/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: taokada <taokada@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/09/19 21:37:18 by taokada           #+#    #+#             */
/*   Updated: 2023/09/19 21:43:27 by taokada          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

int	ft_isascii(int c)
{
	if (c >= 0 && c <= 127)
		return (1);
	return (0);
}

// #include<stdio.h>
// int main(){
// 	int a = 'a';
// 	printf("%d",ft_isascii(a));
// 	printf("%d",ft_isascii());
// }よくわかってない